org/how-to-create-a-new-post.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-19 lun 02:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to create a post    .</title>
<meta name="author" content="Pascual M.G." />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">How to create a post    .</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7148cc7">1. Define your router file in your .env</a></li>
<li><a href="#org0d7cbd5">2. Arrancamos el cohete.</a></li>
<li><a href="#org4e35206">3. Create a new entry for the new <code>Controller/HttpRequestHandler</code></a></li>
<li><a href="#orge87fbd4">4. Create the <code>Controller</code></a>
<ul>
<li><a href="#org318ee59">4.1. Una &ldquo;larga y necesaria aclaraci칩n&rdquo; antes de seguir.</a></li>
</ul>
</li>
<li><a href="#orgaa8c7f2">5. Vamos a por ese Content</a></li>
<li><a href="#org71e2bcf">6. PostCreator domain service.</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7148cc7" class="outline-2">
<h2 id="org7148cc7"><span class="section-number-2">1.</span> Define your router file in your .env</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-php"><span style="color: #a45bad;">ROUTES_PATH</span>=/Users/passh/src/php/reactor/src/ddd/Infrastructure/HttpServer/Router/routes.json

</pre>
</div>
</div>
</div>
<div id="outline-container-org0d7cbd5" class="outline-2">
<h2 id="org0d7cbd5"><span class="section-number-2">2.</span> Arrancamos el cohete.</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
Entramos en el directorio del proyecto y ejecutamos
</p>
<div class="org-src-container">
<pre class="src src-bash">  nix develop
</pre>
</div>

<blockquote>
<p>
Hay que tener en cuenta que nix debe estar instalado en el sistema , y las experimental features nix-command y flakes deben estar activas .
</p>
</blockquote>

<p>
Una vez dentro  de esta consola dispondremos de la version de php indicada con xdebug , ya que por defecto se arranca con estos m칩dulos en la shell de desarrollo.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org4e35206" class="outline-2">
<h2 id="org4e35206"><span class="section-number-2">3.</span> Create a new entry for the new <code>Controller/HttpRequestHandler</code></h2>
<div class="outline-text-2" id="text-3">
<p>
#+begin<sub>src</sub> php
[
  {
    &ldquo;method&rdquo;: &ldquo;POST&rdquo;,
    &ldquo;path&rdquo;: &ldquo;/post&rdquo;,
    &ldquo;handler&rdquo;: &ldquo;\\pascualmg\\reactor\\ddd\\Infrastructure\\HttpServer\\RequestHandler\\CreatePostController&rdquo;
  }
]
#+end<sub>src</sub> php
</p>
</div>
</div>
<div id="outline-container-orge87fbd4" class="outline-2">
<h2 id="orge87fbd4"><span class="section-number-2">4.</span> Create the <code>Controller</code></h2>
<div class="outline-text-2" id="text-4">
<p>
Este seria el skel del que partir, no hace nada mas que responder con un 200 que no es poco 游땐
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #bc6ec5;">&lt;?php</span>

<span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler</span>;

<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ResponseInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ServerRequestInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Http\Message\Response</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Promise\PromiseInterface</span>;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CreatePostController</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">HttpRequestHandler</span>
<span style="color: #4f97d7;">{</span>

    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__invoke</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">ServerRequestInterface</span> $<span style="color: #7590db;">request</span>, <span style="color: #ce537a; font-weight: bold;">?array</span> $<span style="color: #7590db;">routeParams</span><span style="color: #bc6ec5;">)</span>: <span style="color: #ce537a; font-weight: bold;">ResponseInterface</span>|PromiseInterface <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">of a response Interface</span>
    <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Response</span><span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

</pre>
</div>
</div>
<div id="outline-container-org318ee59" class="outline-3">
<h3 id="org318ee59"><span class="section-number-3">4.1.</span> Una &ldquo;larga y necesaria aclaraci칩n&rdquo; antes de seguir.</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Todos los Condroladores , deben implementar <code>HttpRequestHandler</code> , no ha de verse como una restricci칩n en absoluto, ya que reactPHP no impone aqu칤 ninguna restricci칩n se podria usar una lamda cualquiera, este tipado lo brinda el microFramework 游 , En este caso ese tipado es algo que nos brinda una clara visi칩n de lo que puede o no hacer, y debe o no hacer , nuestro controlador.
</p>

<p>
En esa firma es donde se define, ahora en php8 posibles valores de retorno, esto que podr칤a a priori parecer un smellcode si estamos con el chip funcional en mente,  por que as칤 a simple vista logicamente no es una funci칩n pura, pero si lo pensamos bien , ser칤a la manera sint치ctica de tener un tipo polim칩rfico.
</p>

<blockquote>
<p>
El comentario al final , indica que hay un lack en el lenguaje de php para representar ese concepto, esto tambi칠n nos va a pasar en sitios como los respositorios, donde , yo puedo devolver una promise , que se resolver치 en un array de post , y como programador lo debo de saber y respetar .
</p>

<p>
Lo importante es tenerlo claro , que si vas a devolver una promise, aka <b>deferred</b> o &ldquo;en diferido &#x2026;&rdquo; su <span class="underline">resolve</span> <b>TIENE  QUE</b> devolver una <code>ResponseInterface</code> , este , es un punto clave a entender
ya que es como nuestro kernel espera que sea .
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgaa8c7f2" class="outline-2">
<h2 id="orgaa8c7f2"><span class="section-number-2">5.</span> Vamos a por ese Content</h2>
<div class="outline-text-2" id="text-5">
<p>
Ahora que ya tenemos el controller devolviendo un 200 , es la hora de ver como obtenemos el payload que nos viene en la request , en este caso va a ser como un JSON , que contendr치 los par치metros necesarios para crear nuestra entidad ( y registro en la DDBB )
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #bc6ec5;">&lt;?php</span>

<span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\RequestHandler</span>;

<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">pascualmg\reactor\ddd\Infrastructure\HttpServer\JsonResponse</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ResponseInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">Psr\Http\Message\ServerRequestInterface</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Http\Message\Response</span>;
<span style="color: #4f97d7; font-weight: bold;">use</span> <span style="color: #ce537a; font-weight: bold;">React\Promise\PromiseInterface</span>;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CreatePostController</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">HttpRequestHandler</span>
<span style="color: #4f97d7;">{</span>

    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__construct</span><span style="color: #bc6ec5;">(</span>
   <span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">private readonly PostCreator $postCreator</span>
    <span style="color: #bc6ec5;">)</span>
    <span style="color: #bc6ec5;">{</span>
    <span style="color: #bc6ec5;">}</span>

    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">__invoke</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">ServerRequestInterface</span> $<span style="color: #7590db;">request</span>, <span style="color: #ce537a; font-weight: bold;">?array</span> $<span style="color: #7590db;">routeParams</span><span style="color: #bc6ec5;">)</span>: <span style="color: #ce537a; font-weight: bold;">ResponseInterface</span>|PromiseInterface
    <span style="color: #bc6ec5;">{</span>
        $<span style="color: #7590db;">body</span> = $<span style="color: #7590db;">request</span>-&gt;getBody<span style="color: #2d9574;">()</span>-&gt;getContents<span style="color: #2d9574;">()</span>;
        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #2d9574;">{</span>
            $<span style="color: #7590db;">payload</span> = json_decode<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">body</span>, <span style="color: #a45bad;">true</span>, <span style="color: #a45bad;">512</span>, <span style="color: #a45bad;">JSON_THROW_ON_ERROR</span><span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">\JsonException</span> $<span style="color: #7590db;">e</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">JsonResponse</span>::withError<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">e</span><span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span>

        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Response</span><span style="color: #2d9574;">(</span>
            <span style="color: #a45bad;">200</span>,
            <span style="color: #67b11d;">[</span><span style="color: #2d9574;">"Content-Type"</span> =&gt; <span style="color: #2d9574;">"application/json"</span><span style="color: #67b11d;">]</span>,
            json_encode<span style="color: #67b11d;">(</span>$<span style="color: #7590db;">payload</span><span style="color: #67b11d;">)</span>
        <span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

</pre>
</div>

<p>
En la linea 96 ya tenemos la manera de obtener f치cilmente el json que nos viene de la request , una vez la obtenemos por el momento simplemente la devolvemos tal cual nos llegue.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ce537a; font-weight: bold;">curl</span> -X POST --location <span style="color: #2d9574;">"http://localhost:8000/post"</span> <span style="color: #2d9574;">\</span>
    -H <span style="color: #2d9574;">"Content-Type: application/json"</span> <span style="color: #2d9574;">\</span>
    -d <span style="color: #2d9574;">'{</span>
<span style="color: #2d9574;">          "foo": "bar"</span>
<span style="color: #2d9574;">        }'</span>

</pre>
</div>

<p>
Est치 funcionando tal como se espera , esto de evaluar c칩digo en el .org es <span class="underline">magic</span>
</p>


<p>
Lo m치s ortodoxo ser칤a pues hacer un Command Handler que llame al repo etc, pero por &ldquo;simplificar&rdquo;
el desarrollo inicialmente simplemente llamare al save del repo .
</p>

<ol class="org-ol">
<li>A침adido el nuevo m칠todo a la interfaz de dominio.</li>
</ol>


<div class="org-src-container">
<pre class="src src-nil">

</pre>
</div>
</div>
</div>
<div id="outline-container-org71e2bcf" class="outline-2">
<h2 id="org71e2bcf"><span class="section-number-2">6.</span> PostCreator domain service.</h2>
<div class="outline-text-2" id="text-6">
<p>
Es momento de implmentar este servicio de dominio, que se encargar치 de crear usando el <code>PostRepository</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pascual M.G.</p>
<p class="date">Created: 2024-02-19 lun 02:24</p>
</div>
</body>
</html>
